#include <iostream>
#include <Windows.h>

int main() {

    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);

    // ќголошенн€ зм≥нних дл€ ц≥н та к≥лькост≥ покупок
    int d, k, a, b, n, l, S;

    // «читуванн€ даних в≥д користувача
    std::cout << "¬вед≥ть ц≥ну книги (грн.): ";
    std::cin >> d;

    std::cout << "¬вед≥ть ц≥ну книги (коп.): ";
    std::cin >> k;

    std::cout << "¬вед≥ть ц≥ну журналу (грн.): ";
    std::cin >> a;

    std::cout << "¬вед≥ть ц≥ну журналу (коп.): ";
    std::cin >> b;

    std::cout << "¬вед≥ть к≥льк≥сть журнал≥в: ";
    std::cin >> n;

    std::cout << "¬вед≥ть к≥льк≥сть книг: ";
    std::cin >> l;

    std::cout << "¬вед≥ть на€вн≥ кошти (грн.): ";
    std::cin >> S;

    // ќбчисленн€ вартост≥ журнал≥в та книг
    int total_cost = n * (a * 100 + b) + l * (d * 100 + k);

    // ѕерев≥рка, чи вистачить кошт≥в
    if (total_cost <= S * 100) {
        std::cout << "¬ам вистачить кошт≥в на покупку вс≥х журнал≥в та книг." << std::endl;
    }
    else {
        std::cout << "¬ам не вистачить кошт≥в на покупку вс≥х журнал≥в та книг." << std::endl;
    }

    return 0;
}
